Tekla.Structures.Model.RebarSplitter
The RebarSplitter class represents a modifier that can split the Tekla.Structures.Model.RebarSet reinforcing bars that pass through it.
The following example shows how to create and add a RebarSplitter, to a rebarset.
using Tekla.Structures.Model;
using Tekla.Structures.Geometry3d;
public class Example
{
public void Example1()
{
// Create and insert a rebarset (see the RebarSet example).
var rebarSet = new RebarSet();
// Create the RebarSplitter
var strip = new RebarSplitter();
strip.Father = rebarSet;
strip.SplitType = RebarSplitter.SplitTypeEnum.LAPPING;
strip.Lapping.LappingType = RebarLapping.LappingTypeEnum.CUSTOM_LAPPING;
strip.Lapping.LapLength = 100;
strip.StaggerType = RebarSplitter.StaggerTypeEnum.STAGGER_LEFT;
strip.StaggerOffset = 200;
strip.SplitOffset = 50;
strip.Curve.AddContourPoint(new ContourPoint(new Point(400, 200, 0), null));
strip.Curve.AddContourPoint(new ContourPoint(new Point(400, 1000, 0), null));
strip.Insert();
}
}

Tekla.Structures.Model.RebarSplitter.#ctor
Initializes a new instance of the Tekla.Structures.Model.RebarSplitter class.

Tekla.Structures.Model.RebarSplitter.StaggerType
Gets or sets the stagger type.

Tekla.Structures.Model.RebarSplitter.StaggerOffset
Gets or sets the additional offset (stagger) of the split location for every other split reinforcing bar.

Tekla.Structures.Model.RebarSplitter.SplitOffset
Gets or sets the offset of the split from the location of the rebar splitter.

Tekla.Structures.Model.RebarSplitter.SplitType
Gets or sets the split type.

Tekla.Structures.Model.RebarSplitter.Lapping
Gets or sets the rebar lapping.

Tekla.Structures.Model.RebarSplitter.Cranking
Gets or sets the rebar cranking.

Tekla.Structures.Model.RebarSplitter.GetAffectedBars(Tekla.Structures.Model.BaseRebarModifier.AffectedRebarEnum)
Gets the virtual bars affected by this splitter.
whichEnd: A value indicating which end of the bars the splitter should affect.
Returns: A Tekla.Structures.Model.ModelObjectEnumerator containing the virtual rebars of the rebar set that are affected.

Tekla.Structures.Model.RebarSplitter.CreateInstance
The create instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarSplitter.ModifyInstance
The modify instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarSplitter.SelectInstance
The select instance.
Returns: The System.Boolean.

Tekla.Structures.Model.RebarSplitter.ToStruct(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The to struct.
dotStrip: The dot strip.

Tekla.Structures.Model.RebarSplitter.FromStruct(Tekla.Structures.ModelInternal.dotRebarSplitter_t@)
The from struct.
dotStrip: The dot strip.